---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ManyCCWLoopsError
source: html/19527e2a-d838-9d2c-5efe-82f35229c84d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ManyCCWLoopsError Property

Area defined by sketch must be connected.

## Syntax (C#)
```csharp
public static FailureDefinitionId ManyCCWLoopsError { get; }
```